{
    "experience" : [
        {
            "title": "UBC Launch Pad", 
            "position" : "Developer",
            "date": "September 2021 - Present", 
            "description": "UBC Launch Pad is a student-run software engineering design team. Students work together in groups consisting of developers, designers and leads to build applications that provide novel solutions to common challenges we may face.",
            "contribution": "I helped my team develop a mobile group task management. It features progress tracking, task quotas and a points system. The app was built with Flutter and hosted on Firebase and uses Firestore as a database.", 
            "icon" : "images/LP_Icon.png"            
        },
        {
            "title": "Building Blocks", 
            "position" : "Web Developer",
            "date": "May 2021 - September 2021", 
            "description": "Building Blocks Peer Mentoring is a student initiative that aims towards improving student life on campus. Using an algorithm, freshmen will be matched with an upper-year mentor. Through their mentors, incoming students will have the social, academic and professional support they need to thrive on campus.", 
            "contribution": "Starting with no experience with web development, I quickly became familiar with frontend fundamentals. As a result, I was able to create multiple reponsive web pages for our MERN app. Once I learned some backend development basics, I helped implement chat functions using socket.io ", 
            "icon" : "images/BB_logo.png", 
            "link": ""
        },
        {
            "title": "UBC Solar", 
            "position" : "Software Member",
            "date": "September 2020 - September 2021", 
            "description": "UBC Solar is an engineering design team that builds solar-powered electric cars. Every component from the chassis, suspension, PCBs and firmware are designed and created by the team. Pre-covid, UBC Solar's cars would compete in North America-wide solar car endurance races", 
            "contribution": "On the software team, I mainly wrote firmware to implement the handling and synchronization of messages to the car's main control board. This was facilated with the help of a FreeRTOS OS kernel and embedded C. ", 
            "icon" : "images/Solar_Icon.png", 
            "link": ""
        }
    ],
    "projects" : [
        {
            "title": "CrossyRoad", 
            "cover": "images/crossy1.png",
            "prim_img": "images/crossy1.png", 
            "description": "A remake of the popular mobile game CrossyRoad purely written in Java. The game allows the player to navigate around the board with keyboard input and animates moving cars smoothly. This project required me to make many considerations concerning the design of the game and how each game component would interact with one another. As a result, I have a firm understanding of OOP", 
            "sup_img" : "images/crossy2.png" ,
            "link": "https://github.com/AlexLassooij/CrossyRoad"                     
        },
        {
            "title": "Amazoon", 
            "cover": "images/amazoon_homepage.png",
            "prim_img": "images/amazon2.png", 
            "description": "An Amazon clone. This clone automatically simulates a warehouse in real-time. For example, when an order is placed through our webpage, robots will physically move around the warehouse, gather the order's items and place them into a truck, all without any human interaction. Synchronization is achieved through mutual exclusion and a database that holds live information about orders and items. Completed as a term project for a Systems Software Engineering course. Written in C# with an ASP.NET MVC webpage, mongoDB database and WinForms as a graphical display for the warehouse", 
            "sup_img" : "images/warehousesism.png"  ,
            "link": "https://github.com/AlexLassooij/Amazoond"          
        },
        {
            "title": "Feed Me", 
            "cover": "images/slack1.png",
            "prim_img": "images/slack1.png", 
            "description": "A Slack bot for the Slack workspace. I created this bot to help people choose their next meal when work or other responsibilities leave little time to ponder about food. Users can choose to eat either eat nearby, or have a recipe suggested based on what's in their pantry. Created with Python and Slack Block Kit", 
            "sup_img" : "images/slack2.png",
            "link": "https://github.com/AlexLassooij/SlackApp"          
            
        },
        {
            "title": "RISC Machine", 
            "cover": "images/RISC1.png",
            "prim_img": "images/RISC1.png", 
            "description": "As part of an Introduction to Microcomputers course, I was required to design my own Reduced Instruction Set Computer. Using Verilog, I created all necessary components such as the datapath, ALU, etc. I wrote exhaustive unit tests and debugged the machine by analyzing key signals produced by several components and using the De1-SoC FPGA board (pictured right). As a result, the machine was able to carry out various ARM instructions and ranked as the 11th most efficient out of 100+ machines.",
            "sup_img" : "images/RISC2.png" ,
            "link": "https://github.com/AlexLassooij/RISC_Machine"          
           
        },
        {
            "title": "ECE Projects Year 2", 
            "cover": "images/ECE.jpeg",
            "prim_img": "images/291P2.jpeg", 
            "description": "For my 2nd year Electrical Engineering project course, I completed two projects. The first (pictured left) is a metal detector. It is capable of detecting ferrous and non-ferrous metals. Metallic objects placed inside an induction coil are detected as they change the oscillation frequency of the device's A-stable oscillator. The second project (pictured right) is a water level detector. It measures the water level in a cup using the fact that the cup's capacitance varies with different water levels",
            "sup_img" : "images/291P1.jpeg",
            "link": "https://github.com/AlexLassooij/ELEC291_Project_2"            
        }
    ]

}